Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.MaterialTexture Property
 An external resource type representing material texture images.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType MaterialTexture { get; }
Public Shared ReadOnly Property MaterialTexture As ExternalResourceType
	Get
public:
static property ExternalResourceType^ MaterialTexture {
	ExternalResourceType^ get ();
}
static member MaterialTexture : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace